<template>
	<view class="rank-page">
		<mymap2 :path="path" :center='center' :zoom='15' :mapheight='50' :routes='routes'></mymap2>
		<view class="rank-title">Mileage Ranking</view>
		<view class="rank-list">
			<view v-for="(item, index) in rankList" :key="index" class="rank-item">
				<view class="rank-info">
					<view class="rank-number">{{ index + 1 }}</view>
					<image :src="item.img" mode="aspectFill" class="avatar-image"></image>
					<view class="rank-name">{{ item.name }}</view>
				</view>
				<view class="rank-steps">{{ item.distance }} km</view>
			</view>
		</view>
	</view>
</template>

<script>
	import mymap2 from '../../components/map/mymap2.vue';

	export default {
		components: {
			mymap2,
		},
		data() {
			return {
				rankList: [{
						name: 'Veroooo',
						img: '../../static/user_pic/2.jpg',
						distance: 4.1
					},
					{
						name: 'Yodo',
						img: '../../static/user_pic/1.jpg',
						distance: 3.9
					},
					{
						name: 'Pease of Summer',
						img: '../../static/user_pic/3.jpg',
						distance: 3.8
					},
				
				],
				routes: [{
						path: [
							[
								103.986193,
								30.757726
							],
							[
								103.986179,
								30.757617
							],
							[
								103.986179,
								30.757559
							],
							[
								103.986206,
								30.757415
							],
							[
								103.98619,
								30.757272
							],
							[
								103.986195,
								30.757178
							],
							[
								103.986202,
								30.757023
							],
							[
								103.986202,
								30.75693
							],
							[
								103.986211,
								30.756844
							],
							[
								103.986247,
								30.756751
							],
							[
								103.986292,
								30.756662
							],
							[
								103.986337,
								30.756627
							],
							[
								103.986408,
								30.756593
							],
							[
								103.98644,
								30.756565
							],
							[
								103.986505,
								30.756551
							],
							[
								103.98661,
								30.756544
							],
							[
								103.986666,
								30.756551
							],
							[
								103.986812,
								30.756579
							],
							[
								103.986812,
								30.756607
							],
							[
								103.98686,
								30.756641
							],
							[
								103.986892,
								30.756662
							],
							[
								103.986933,
								30.756711
							],
							[
								103.986933,
								30.756746
							],
							[
								103.986957,
								30.756794
							],
							[
								103.986965,
								30.756822
							],
							[
								103.986973,
								30.75687
							],
							[
								103.986973,
								30.756926
							],
							[
								103.986965,
								30.757023
							],
							[
								103.986981,
								30.757134
							],
							[
								103.986989,
								30.757204
							],
							[
								103.986981,
								30.757273
							],
							[
								103.986981,
								30.757349
							],
							[
								103.986981,
								30.757488
							],
							[
								103.986981,
								30.757564
							],
							[
								103.986941,
								30.757655
							],
							[
								103.986949,
								30.757703
							],
							[
								103.986941,
								30.757745
							],
							[
								103.986892,
								30.7578
							],
							[
								103.98682,
								30.757869
							],
							[
								103.986771,
								30.757918
							],
							[
								103.98669,
								30.757918
							],
							[
								103.986602,
								30.757945
							],
							[
								103.986529,
								30.757931
							],
							[
								103.986481,
								30.757931
							],
							[
								103.9864,
								30.757918
							],
							[
								103.986351,
								30.757883
							],
							[
								103.986303,
								30.757841
							],
							[
								103.986254,
								30.7578
							],
							[
								103.986206,
								30.757723
							],
							[
								103.986166,
								30.757523
							],

						],
						center: [
							103.9864,
							30.757418
						],
					},
					{
						path: [
							[
								103.977527,
								30.767054
							],
							[
								103.977643,
								30.766825
							],
							[
								103.977727,
								30.766768
							],
							[
								103.977826,
								30.766625
							],
							[
								103.977926,
								30.766525
							],
							[
								103.978076,
								30.766325
							],
							[
								103.978375,
								30.765926
							],
							[
								103.978558,
								30.76574
							],
							[
								103.978741,
								30.765526
							],
							[
								103.978874,
								30.765297
							],
							[
								103.978973,
								30.765269
							],
							[
								103.97904,
								30.765255
							],
							[
								103.979106,
								30.765312
							],
							[
								103.979273,
								30.765355
							],
							[
								103.979406,
								30.765483
							],
							[
								103.979672,
								30.765583
							],
							[
								103.979788,
								30.765669
							],
							[
								103.979938,
								30.765769
							],
							[
								103.980154,
								30.765869
							],
							[
								103.980337,
								30.766012
							],
							[
								103.980486,
								30.766097
							],
							[
								103.980619,
								30.766169
							],
							[
								103.980669,
								30.766169
							],
							[
								103.980736,
								30.766026
							],
							[
								103.980785,
								30.76584
							],
							[
								103.980835,
								30.765697
							],
							[
								103.981051,
								30.765612
							],
							[
								103.981168,
								30.765569
							],
							[
								103.981317,
								30.765555
							],
							[
								103.981517,
								30.765555
							],
							[
								103.98175,
								30.765497
							],
							[
								103.981999,
								30.76534
							],
							[
								103.982165,
								30.765155
							],
							[
								103.982282,
								30.764969
							],
							[
								103.982365,
								30.764812
							],


						],
						center: [
							103.981051,
							30.763501
						],
					},
					{
						path: [
							[
								103.984276,
								30.768216
							],
							[
								103.984082,
								30.768406
							],
							[
								103.983949,
								30.76852
							],
							[
								103.983872,
								30.768615
							],
							[
								103.983684,
								30.768767
							],
							[
								103.983529,
								30.768891
							],
							[
								103.983462,
								30.768995
							],
							[
								103.983308,
								30.769176
							],
							[
								103.983263,
								30.769185
							],
							[
								103.98312,
								30.7691
							],
							[
								103.982998,
								30.768967
							],
							[
								103.982832,
								30.768853
							],
							[
								103.982511,
								30.768625
							],
							[
								103.982368,
								30.768511
							],
							[
								103.982312,
								30.768492
							],
							[
								103.982279,
								30.768492
							],
							[
								103.982235,
								30.768596
							],
							[
								103.982191,
								30.768663
							],
							[
								103.982158,
								30.768653
							],
							[
								103.981947,
								30.768587
							],
							[
								103.981925,
								30.76853
							],
							[
								103.981815,
								30.768463
							],
							[
								103.981793,
								30.768397
							],
							[
								103.981815,
								30.768302
							]
						],
						center: [
							103.982191,
							30.768663
						],
					}
					// {
						// path:[
						//  [103.982895, 30.763873], // 起点坐标
						//  [103.986895, 30.765574], // 中间点坐标
						//  [103.987694, 30.766872]  // 终点坐标
						// ],
						//  center: [103.982895, 30.767574], }
					]
				}
			},
			  onLoad(){
				  console.log('haha')
				  uni.request({
				              url: 'http://120.46.81.37:8080/app/get_rank',
				              method: 'GET',
				              success: (res) => {
				                  this.rankList=res.rank_list
								  this.routes=res.routes

				              },
				              fail: (err) => {
				                  console.error('Error fetching person info:', err);

				              }
			  })
			}  
		}
</script>

<style scoped>
	.rank-page {
		padding: 20rpx;
		background-color: #f0f3f5;
		/* 淡灰色背景 */
	}

	.rank-title {
		text-align: center;
		font-size: 36rpx;
		font-weight: bold;
		color: black;
		margin-bottom: 30rpx;
	}

	.rank-list {
		display: flex;
		flex-direction: column;
	}

	.rank-item {
		display: flex;
		align-items: center;
		justify-content: space-between;
		padding: 20rpx 0;
		border-top: 1rpx solid #d9d9d9;
		/* 浅灰色分割线 */
		border-bottom: 1rpx solid #d9d9d9;
		/* 浅灰色分割线 */
	}

	.rank-number {
		width: 70rpx;
		height: 70rpx;
		line-height: 70rpx;
		/* 垂直居中 */
		text-align: center;
		font-size: 40rpx;
		font-weight: bold;
		color: #fff;
		background-color: skyblue;
		/* 蓝色背景 */
		border-radius: 50%;
		/* 圆形 */
		margin-right: 10rpx;
	}

	.rank-info {
		display: flex;
		align-items: center;
		flex: 1;
		/* 占用剩余空间 */
	}

	.rank-name {
		font-size: 40rpx;
		font-weight: bold;
		color: #333;
		/* 深灰色名字 */
	}

	.rank-steps {
		font-size: 35rpx;
		color: black;
		/* 蓝色步数 */
		text-align: right;
	}


	.avatar-image {
		width: 80rpx;
		/* 设置一个固定的宽度，你可以根据需要调整 */
		height: 80rpx;
		/* 如果你想保持正方形头像，也设置一个高度 */
		overflow: hidden;
		/* 确保图片不会超出容器 */
		border-radius: 50%;
		/* 保持图片为圆形 */
		margin-right: 20rpx;
		/* 右边距，用于与排名信息分隔 */

	}
</style>